# Using Python to fetch Data from SQL

In [ ]:
import mysql.connector
import pandas as pd

In [2]:
conn = mysql.connector.connect(host="localhost",user="root", password="")

In [3]:
mycursor = conn.cursor()
mycursor.execute("drop database if exists sqlpython")
mycursor.execute("create database sqlpython")
print ("Database Created")

Database Created

In [5]:
conn = mysql.connector.connect(host="localhost",user="root", password="", database = "sqlpython")
mycursor = conn.cursor()

In [6]:
mycursor.execute("create table employee(id int auto_increment primary key, name varchar(25), age varchar (3), mobile varchar (10) )")
print ("Table created")

Table created

In [7]:
sql = "insert into employee(name, age, mobile) values('Saran', '20','9566472007'),('Nithish', '22','9977889988'),('Ram','30','912345678'),('Ravi','31','911345678'),('Akash','20','912355678'),('Raju','31','912345679'),('Bharath','24','912245678'),('Deva','36','918345678'),('Gokul','40','999345678'),('Mahesh','29','912349778')"
mycursor.execute(sql)
conn.commit()

In [8]:
mycursor.execute("select * from employee")
myresult = mycursor.fetchall()
print(myresult)

[(1, 'Saran', '20', '9566472007'), (2, 'Nithish', '22', '9977889988'), (3, 'Ram', '30', '912345678'), (4, 'Ravi', '31', '911345678'), (5, 'Akash', '20', '912355678'), (6, 'Raju', '31', '912345679'), (7, 'Bharath', '24', '912245678'), (8, 'Deva', '36', '918345678'), (9, 'Gokul', '40', '999345678'), (10, 'Mahesh', '29', '912349778')]

In [13]:
rawdata = pd.read_sql_query("select * from employee",conn)
rawdata

C:\Users\hp\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id     name age      mobile
0   1    Saran  20  9566472007
1   2  Nithish  21  9977889988
2   3      Ram  30   912345678
3   4     Ravi  31   911345678
4   5    Akash  20   912355678
5   6     Raju  31   912345679
6   7  Bharath  24   912245678
7   8     Deva  36   918345678
8   9    Gokul  40   999345678
9  10   Mahesh  29   912349778

In [14]:
mycursor.execute("update employee set age='22' where age='21'")
conn.commit()

In [15]:
rawdata = pd.read_sql_query("select * from employee",conn)
rawdata

C:\Users\hp\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id     name age      mobile
0   1    Saran  20  9566472007
1   2  Nithish  22  9977889988
2   3      Ram  30   912345678
3   4     Ravi  31   911345678
4   5    Akash  20   912355678
5   6     Raju  31   912345679
6   7  Bharath  24   912245678
7   8     Deva  36   918345678
8   9    Gokul  40   999345678
9  10   Mahesh  29   912349778

In [16]:
rawdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      10 non-null     int64
 1   name    10 non-null     object
 2   age     10 non-null     object
 3   mobile  10 non-null     object
dtypes: int64(1), object(3)
memory usage: 448.0+ bytes

In [18]:
rawdata.isna().values.any()

False